---
kind: property
id: P:Autodesk.Revit.DB.OverrideGraphicSettings.CutForegroundPatternId
source: html/e282ebe8-2744-3419-7da0-ef8cda7e3a8c.htm
---
# Autodesk.Revit.DB.OverrideGraphicSettings.CutForegroundPatternId Property

The ElementId of the cut face foreground fill pattern override.
 A value of InvalidElementId means no override is set.

## Syntax (C#)
```csharp
public ElementId CutForegroundPatternId { get; }
```